from pathlib import Path

import cv2
import numpy as np

from SynthImage.Augmentation.background import BackgroundAugmentation
from SynthImage.SynthPageImage.modern_book_format_page_image import (
    ModernBookPageGenerator,
)

font_path = "./data/fonts/Drutsa_short/Kangba Derchi-Drutsa.ttf"
mpgobject = ModernBookPageGenerator(45, 45, 50, 50, [(626, 771), (1063, 1536)])
text = """  ༄༅༅། །རྒྱ་གར་སྐད་དུ། བི་ན་ཡ་བསྟུ། བོད་སྐད་དུ། འདུལ་བ་གཞི། བམ་པོ་དང་པོ། དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །གང་གིས་འཆིང་
རྣམས་ཡང་དག་རབ་བཅད་ཅིང་། །མུ་སྟེགས་ཚོགས་རྣམས་ཐམས་ཅད་རབ་བཅོམ་སྟེ། །སྡེ་དང་བཅས་པའི་བདུད་རྣམས་ངེས་བཅོམ་ནས། །བྱང་ཆུབ་འདི་བརྙེས་དེ་ལ་
ཕྱག་འཚལ་ལོ། །ཁྱིམ་དོན་ཆེ་ཆུང་སྤངས་ཏེ་དང་པོར་རབ་འབྱུང་དཀའ། །རབ་བྱུང་ཐོབ་ནས་ཡུལ་སྤྱད་དག་གིས་དགའ་ཐོབ་དཀའ། །མངོན་དགའ་ཇི་བཞིན་དོན་བསྐྱེད་ཡང་
དག་བྱེད་པ་དཀའ། །ངུར་སྨྲིག་གོས་འཆང་མཁས་པ་ཚུལ་ལས་ཉམས་པ་དཀའ། །གཞི་རྣམས་ཀྱི་སྤྱི་སྡོམ་ལ། རབ་འབྱུང་གསོ་སྦྱོང་གཞི་དང་ནི། །དགག་དབྱེ་དབྱར་དང་ཀོ་
ལྤགས་གཞི། །སྨན་དང་གོས་དང་སྲ་བརྐྱང་དང་། །ཀཽ་ཤཱམ་བཱི་དང་ལས་ཀྱི་གཞི། །དམར་སེར་ཅན་དང་གང་ཟག་དང་། །སྤོ་དང་གསོ་སྦྱོང་བཞག་པ་དང་། །གནས་མལ་དང་ནི་

རྩོད་པ་དང་། །དགེ་འདུན་དབྱེན་རྣམས་བསྡུས་པ་ཡིན། །རབ་ཏུ་འབྱུང་བའི་གཞིའི་སྤྱི་སྡོམ་ལ། ཤཱ་རིའི་བུ་དང་མུ་སྟེགས་ཅན། །དགེ་ཚུལ་གཉིས་དང་བྱ་རོག་སྐྲོད། །དགྲ་བཅོམ་བསད་དང་ལག་རྡུམ་གྱི། །སྡེ་ཚན་
ཡང་དག་བསྡུས་པ་ཡིན། །སྡོམ་ལ། ཤཱ་རིའི་བུ་དང་རབ་འབྱུང་དང་། །བསྙེན་པར་རྫོགས་པར་གནང་བ་དང་། །ཉེ་སྡེས་ཚོགས་ནི་བསྡུས་པ་དང་། །ལྔ་པའི་སྡེ་ཚན་བསྡུས་པ་ཡིན། །བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པ་ན།
ཡུལ་ཨང་ག་དག་ན་ཨང་གའི་རྒྱལ་པོ་ཞེས་བྱ་བས་རྒྱལ་སྲིད་འབྱོར་པ། རྒྱས་པ་བདེ་བ་ལོ་ལེགས་པ་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་བྱེད་དུ་བཅུག་གོ། །ཡུལ་མ་ག་དྷཱ་དག་ན་ཡང་རྒྱལ་པོ་པད་མ་ཆེན་པོ་ཞེས་བྱ་བས། རྒྱལ་སྲིད་འབྱོར་པ་རྒྱས་པ་བདེ་བ་ལོ་
ལེགས་པ་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་བྱེད་དུ་བཅུག་གོ། །རེས་འགའ་ནི་ཨང་གའི་རྒྱལ་པོ་དཔུང་དང་མཐུ་ཆེ་བ་ཡིན་ལ། རེས་འགའ་ནི་རྒྱལ་པོ་པད་མ་ཆེན་པོ་དཔུང་དང་མཐུ་ཆེ་བ་ཡིན་ནོ། །གང་གི་ཚེ་ཨང་གའི་རྒྱལ་པོ་དཔུང་དང་མཐུ་ཆེ་བ་དེའི་ཚེ་
ན། དེས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ། གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ། ཡུལ་མ་ག་དྷཱ་རྒྱལ་པོའི་ཁབ་མ་གཏོགས་པ་བཅོམ་ནས་ཕྱིར་ལྡོག་པར་
བྱེད་དོ། །གང་གི་ཚེ་རྒྱལ་པོ་པད་མ་ཆེན་པོ་དཔུང་དང་མཐུ་ཆེ་བ་དེའི་ཚེ་ན། དེས་ཀྱང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ། གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ།

ཡུལ་ཨང་ག་ཙམ་པ་མ་གཏོགས་པ་བཅོམ་ནས་ཕྱིར་ལྡོག་པར་བྱེད་དོ། །དེ་ནས་དུས་གཞན་ཞིག་ན་ཨང་གའི་རྒྱལ་པོ་དཔུང་དང་མཐུ་ཆེ་བར་གྱུར་ནས། དེས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་
བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ། ཡུལ་མ་ག་དྷཱ་གཞོམ་པར་བརྩམས་པ་དང་། མ་ག་དྷཱ་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་ཀྱིས་རྒྱལ་པོ་པད་མ་ཆེན་པོ་ལ་ལྷ་ཨང་གའི་རྒྱལ་པོས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་
ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ། ཡུལ་མ་ག་དྷཱ་འཇོམས་པར་བགྱིད་དོ་ཞེས་སྦྲོན་པ་དག་བཏང་ངོ་། །རྒྱལ་པོ་པད་མ་ཆེན་པོས་ཀྱང་ཐོས་ནས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་གླང་པོ་ཆེ་པའི་ཚོགས་དང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་།
དཔུང་བུ་ཆུང་གི་ཚོགས་གོ་བསྐོན་ཏེ། ཨང་གའི་རྒྱལ་པོ་དང་གཡུལ་སྤྲད་པའི་ཕྱིར་འཕགས་སོ། །དེ་ནས་ཨང་གའི་རྒྱལ་པོས་རྒྱལ་པོ་པད་མ་ཆེན་པོའི་གླང་པོ་ཆེ་པའི་ཚོགས་ཐམས་ཅད་ཕྲོགས་ཤིང་། རྟ་པའི་ཚོགས་དང་། ཤིང་རྟ་པའི་ཚོགས་དང་། དཔུང་བུ་ཆུང་གི་
ཚོགས་ཐམས་ཅད་ཀྱང་ཕྲོགས་སོ། །རྒྱལ་པོ་པད་མ་ཆེན་པོ་ཡང་ཕམ་པ་དང་། སྐྲག་པ་དང་། བཅོམ་པ་དང་། གཞན་རྒྱལ་བ་དང་། རྒྱབ་ཀྱིས་ཕྱོགས་པར་བྱས་ཏེ། རྒྱལ་པོའི་ཁབ་ཏུ་ཞུགས་ནས་སྒོ་བཅད་དེ། ར་བ་དག་གི་ཁར་སྦྲེངས་ནས་འདུག་གོ། །ཨང་གའི་རྒྱལ་
པོས་རྒྱལ་པོ་པད་མ་ཆེན་པོ་ལ་ཕོ་ཉ་བཏང་སྟེ། གལ་ཏེ་ཕྱིར་འབྱུང་ན་དེ་ལྟ་ན་ལེགས། གལ་ཏེ་ཕྱིར་མི་འབྱུང་ན་ཇི་སྟེ་སྟེང་གི་ནམ་མཁའ་ལ་འགྲོ་ན་ནི་མདའ་བརྒྱུད་པས་ཁྱོད་ལྟུང་བར་བྱའོ། །ཇི་སྟེ་སའི་འོག་ཏུ་འགྲོ་ན་ནི་མཆིལ་པ་དང་དྲང་བའི་ཚུལ་གྱིས་དྲང་བར་བྱའོ། །ཇི་སྟེ་རིའི་
རྩེ་མོར་འཛེག་ན་ནི་དེར་ཡང་ཁྱོད་ཐར་པ་མེད་དོ་ཞེས་སྤྲིང་ངོ་། །རྒྱལ་པོ་པད་མ་ཆེན་པོས་ཕྲིན་ཡིག་བཀླགས་ནས་དེ་མི་བདེ་བར་གྱུར་ཏེ། ལག་པ་ལ་འགྲམ་པ་གཏད་ནས་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་འདུག་ནས། དེས་བློན་པོ་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་ཨང་གའི་རྒྱལ་

པོ་འདི་ནི་གདུག་པ། ཕ་རོལ་གནོན་པ། དཔུང་དང་མཐུ་ཆེ་བར་གྱུར་ལ། དེས་ཡུ་བུ་ཅག་ལ་འདི་དང་འདི་སྐད་ཅེས་སྤྲིང་ན། དེ་ལ་ཡུ་བུ་ཅག་གིས་ཇི་ལྟར་བསྒྲུབ་པར་བྱ། དེ་དག་གིས་ཚིགས་སུ་བཅད་པ་སྨྲས་པ། ཡུལ་དང་སྲོག་ལ་གནོད་གྱུར་ན། །
སྐྱེས་བུས་ཀུན་དུ་སྲོག་བསྲུང་བྱ། །བློ་ཡིས་གཉིས་ཀ་དཔྱད་བྱས་ན། །ཡུལ་ནི་ཡང་རྙེད་སྲོག་རྣམས་མིན། །ལྷ་རྣམ་པ་ཐམས་ཅད་དུ་སླར་འབྱུང་བར་བགྱིའོ། །དེ་རལ་གྲི་མགུལ་དུ་ཐོགས་ཏེ་ཕྱིར་བྱུང་བ་དང་། ཨང་གའི་རྒྱལ་པོས་དེ་ལ་ལོ་ཐང་དང་དཔྱ་ཕབ་སྟེ་དེ་ཉིད་དུ་
བཞག་གོ། །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པས་གཟིགས་པ་ལྔ་པོ་དག་ལ་གཟིགས་ནས་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་དྲུག་པོ་དག་ལ་ལན་གསུམ་བསྒོ་བ་མཛད་དེ། གླང་པོ་ཆེ་ལྟར་སྣང་བར་བསྒྱུར་ཏེ། ཡུམ་གྱི་ལྷུམས་སུ་
ཞུགས་པ་དེའི་ཚེ་ན་ས་ཆེན་པོ་ཤིན་ཏུ་གཡོས་པར་གྱུར་ཅིང་འཇིག་རྟེན་འདི་ཐམས་ཅད་ཀྱང་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ཁ་དོག་གི་མཐུ་བས་ལྷག་པའི་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཅིང་། འཇིག་རྟེན་གྱི་འཇིག་རྟེན་གྱི་བར་གང་ན་ཉི་མ་དང་ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ།
འདི་ལྟར་མཐུ་ཆེ་བ་འདི་གཉིས་ཀྱི་འོད་དག་ཉམས་སུ་མི་མྱོང་བའི་མུན་པ་མུན་གནག་མུན་པར་བྱེད་པས། གནག་པར་གྱུར་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་དེའི་ཚེ་ན་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ནས། སེམས་ཅན་གང་དག་དེར་སྐྱེས་པ་དག་གིས་རང་གི་ལག་པ་བརྐྱང་བ་ཡང་མི་
མཐོང་བ་དེ་དག་གིས་ཀྱང་འོད་དེས་སེམས་ཅན་གཅིག་གིས་གཅིག་མཐོང་ནས་ཤེས་ལྡན་དག་སེམས་ཅན་གཞན་ཡང་འདིར་སྐྱེས་སོ། །ཤེས་ལྡན་དག་སེམས་ཅན་གཞན་ཡང་འདིར་སྐྱེས་སོ་ཞེས་ཤེས་པར་གྱུར་ཏོ། །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་
བལྟམ་པ་དེའི་ཚེ་ན་གྲོང་ཁྱེར་ཆེན་པོ་བཞི་པོ་དག་ཏུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་གི་བུ་ཡང་བཙས་པར་གྱུར་ཏེ། རྒྱལ་པོའི་ཁབ་ཏུ་རྒྱལ་པོ་པད་མ་ཆེན་པོའི་བུ་བཙས་སོ། །མཉན་ཡོད་དུ་ནི་རྒྱལ་པོ་རྩིབས་ཀྱིས་འཕུར་ཚངས་བྱིན་གྱི་བུ་བཙས་སོ། །འཕགས་རྒྱལ་དུ་ནི་རྒྱལ་པོ་མུ་

ཁྱུད་མཐའ་ཡས་ཀྱི་བུ་བཙས་སོ། །ཀཽ་ཤཱམ་བཱིར་ནི་རྒྱལ་པོ་དམག་བརྒྱ་པའི་བུ་བཙས་སོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བལྟམ་པ་ན་འཇིག་རྟེན་ཐམས་ཅད་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ཁ་དོག་གི་མཐུ་བས་ལྷག་པའི་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་
ཅིང་འཇིག་རྟེན་གྱི་འཇིག་རྟེན་གྱི་བར་གང་ན་ཉི་མ་དང་ཟླ་བ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་བ། འདི་ལྟར་མཐུ་ཆེ་བ་འདི་གཉིས་ཀྱི་འོད་དག་ཉམས་སུ་མི་མྱོང་བའི་མུན་པ་མུན་གནག་མུན་པར་བྱེད་པས་གནག་པར་གྱུར་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་དེའི་ཚེ་ན་སྣང་བ་རྒྱ་ཆེན་པོས་ཁྱབ་པར་གྱུར་
ནས། སེམས་ཅན་གང་དག་དེར་སྐྱེས་པ་དག་གིས་རང་གི་ལག་པ་བརྐྱང་བ་ཡང་མི་མཐོང་བ་དེ་དག་གིས་ཀྱང་འོད་དེས་སེམས་ཅན་གཅིག་གིས་གཅིག་མཐོང་ནས་ཤེས་ལྡན་དག་སེམས་ཅན་གཞན་ཡང་འདིར་སྐྱེས་སོ། །ཤེས་ལྡན་དག་སེམས་ཅན་གཞན་ཡང་འདིར་སྐྱེས་སོ་
ཞེས་ཤེས་པར་གྱུར་ཏོ། །རྒྱལ་པོ་པད་མ་ཆེན་པོས་བསམས་པ། བདག་གི་བུ་བཙས་པ་ན་འཇིག་རྟེན་ཉི་མའི་གཟུགས་ཤར་བ་ལྟར་སྣང་ཞིང་འདི་བཙུན་མོ་གཟུགས་ཅན་གྱི་བུ་ཡིན་པས་གཞོན་ནུ་འདིའི་མིང་གཟུགས་ཅན་སྙིང་པོར་གདགས་སོ་སྙམ་ནས་བུ་དེའི་མིང་གཟུགས་
ཅན་སྙིང་པོ་ཞེས་བྱ་བར་བཏགས་སོ། །རྒྱལ་པོ་རྩིབས་ཀྱིས་འཕུར་ཚངས་བྱིན་གྱིས་བསམས་པ། བདག་གི་བུ་བཙས་པ་ན་འཇིག་རྟེན་གསལ་བ་གསལ་བ་ལྟར་སྣང་བས་གཞོན་ནུ་འདིའི་མིང་གསལ་རྒྱལ་དུ་གདགས་སོ་སྙམ་ནས་བུ་དེའི་མིང་གསལ་རྒྱལ་ཞེས་བྱ་བར་
བཏགས་སོ། །རྒྱལ་པོ་དམག་བརྒྱ་པས་བསམས་པ། བདག་གི་བུ་བཙས་པ་ན་འཇིག་རྟེན་ཉི་མ་ཤར་བ་ལྟར་སྣང་བར་གྱུར་པས་གཞོན་ནུ་འདིའི་མིང་ཤར་བར་གདགས་སོ་སྙམ་ནས་བུ་དེའི་མིང་ཤར་བ་ཞེས་བྱ་བར་བཏགས་སོ། །རྒྱལ་པོ་མུ་ཁྱུད་མཐའ་ཡས་ཀྱིས་
བསམས་པ། བདག་གི་བུ་བཙས་པ་ན་འཇིག་རྟེན་རབ་ཏུ་སྣང་བས་སྣང་བར་གྱུར་པས་གཞོན་ནུ་འདིའི་མིང་རབ་སྣང་ཞེས་བྱ་བར་གདགས་སོ་སྙམ་ནས་བུ་དེའི་མིང་རབ་སྣང་ཞེས་བྱ་བར་བཏགས་སོ། །རྒྱལ་པོ་རེ་རེས་བསམས་པ་ཡང་བདག་གི་བུ་འདིའི་མཐུ་ཡིན་ནོ། །བདག་

གི་བུ་འདིའི་མཐུ་ཡིན་ནོ་སྙམ་མོད་ཀྱི། དེ་ནི་དེ་ལྟ་མ་ཡིན་ཏེ། འདི་ལྟར་དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཡིན་པའི་ཕྱིར་རོ། །གང་གི་ཉིན་མོ་གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོ་བཙས་པ་དེ་ཉིད་ཀྱི་ཉིན་མོ་བློན་པོ་ལྔ་བརྒྱ་དག་གི་བུ་ལྔ་བརྒྱ་ཡང་
བཙས་ཏེ། དེ་དག་ཀྱང་རིགས་དང་མཐུན་པར་མིང་བཏགས་སོ། །གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོ་མ་མ་བརྒྱད་པོ་པང་ན་འཚོ་བའི་མ་མ་གཉིས་དང་། ནུ་མ་སྣུན་པའི་མ་མ་གཉིས་དང་། དྲི་མ་འཕྱི་བའི་མ་མ་གཉིས་དང་། རྩེན་གྲོགས་ཀྱི་མ་མ་གཉིས་ལ་རྗེས་སུ་གཏད་དོ། །
དེ་མ་མ་བརྒྱད་པོ་དག་གིས་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་སྙིང་ཁུ་དང་། གཞན་ཡང་ཡོ་བྱད་ཀྱི་བྱེ་བྲག་གཙོ་བོ་གཙོ་བོ་དག་གིས་སྲིང་བར་བྱེད། སྐྱེད་པར་བྱེད་ཅིང་རྫིང་ན་གནས་པའི་པད་མ་བཞིན་མྱུར་དུ་སྐྱེད་པར་བྱེད་དོ། །དེ་གང་གི་ཚེ་ཆེན་
པོར་གྱུར་པ་དེའི་ཚེ་ཡི་གེ་དང་། གྲངས་དང་། རྩིས་དང་། ལག་རྩིས་དང་། དབྱུང་བ་དང་། གཞུག་པ་དང་། གཞག་པ་ལ་ཉེ་བར་ཞུགས་ནས། དེ་ཡི་གེའི་མཐར་ཕྱིན་ཅིང་འབྱེད་པ་དང་། ཀློག་པ་དང་། མཁས་པ་དང་། སྐྱོད་པ་གསལ་བ་དང་། བརྟག་པ་བརྒྱད་
པོ་འདི་ལྟ་སྟེ། རིན་པོ་ཆེ་བརྟག་པ་དང་། གཞི་བརྟག་པ་དང་། གོས་བརྟག་པ་དང་། ཤིང་བརྟག་པ་དང་། གླང་པོ་ཆེ་བརྟག་པ་དང་། རྟ་བརྟག་པ་དང་། བུད་མེད་བརྟག་པ་དང་། སྐྱེས་པ་བརྟག་པ་ལ་མཁས་པར་གྱུར་ཏོ། །རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོར་དབང་
བསྐུར་བ་ལྗོངས་ཀྱི་དབང་ཕྱུག་མཐུ་དང་བརྩོན་འགྲུས་ཐོབ་པ། ས་ཆེན་པོའི་དཀྱིལ་འཁོར་མངོན་པར་རྒྱལ་བར་བྱས་ཏེ་གནས་པ་རྣམས་ཀྱི་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་ཐ་དད་པར་གྱུར་པ་གང་དག་ཡིན་པ་འདི་ལྟ་སྟེ། གླང་པོ་ཆེའི་གཉར་བཞོན་པ་དང་། རྟ་བཞོན་
པ་དང་། ཤིང་རྟའི་ཐབས་དང་། རལ་གྲིའི་ཐབས་དང་། འཕོང་དང་། ཕྱིར་བསྣུར་བ་དང་། མདུན་དུ་བསྣུར་བ་དང་། ལྕགས་ཀྱི་བསྒྱུར་ཐབས་དང་། ཞགས་པ་གདབ་པ་དང་། མདའ་བོ་ཆེ་འཕེན་ཐབས་དང་། འཛིན་སྟངས་དང་། གོམ་སྟངས་དང་། ཐོར་ཚུགས་

དང་། གཅད་པ་དང་། དྲལ་བ་དང་། དབུག་པ་དང་། གནས་ལྔ་པོ་འདི་ལྟ་སྟེ། རྒྱང་ནས་འཕོག་པ་དང་། སྒྲ་གྲགས་པར་འཕོག་པ་དང་། གནད་དུ་འཕོག་པ་དང་། མི་འཆོར་བར་འཕོག་པ་དང་། ཚབས་ཆེ་བ་དེ་དག་ལ་ཡང་ཞུགས་ཤིང་བྱང་བར་གྱུར་ཏོ། །བློན་
པོའི་བུ་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་དག་ལ་བྱང་བར་གྱུར་ཏོ། །དེ་ཕས་བཟོ་སྦྱང་བ་བཅྭ་བརྒྱད་པོ་དག་ལ་བཅུག་ནས་དེའི་མིང་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ། བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །དེ་ནས་དུས་གཞན་
ཞིག་ན་གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོ་གླང་པོ་ཆེ་ལ་ཞོན་ཏེ་ལྗོངས་སུ་བྱུང་བ་དང་། དེས་ཨང་གའི་རྒྱལ་པོའི་ཞོ་ཤས་འཚོ་བ་དག་ལོ་ཐང་དང་དཔྱ་སྡུད་པ་མཐོང་ནས། དེས་སྨྲས་པ། ཤེས་ལྡན་དག་ལོ་ཐང་དང་དཔྱ་སྡུད་པ་འདི་དག་སུའི་ཡིན། དེ་དག་གིས་སྨྲས་པ། ལྷ་
ཨང་གའི་རྒྱལ་པོའི་ལགས་སོ། །དེས་སྨྲས་པ། ཅི་ཡུ་བུ་ཅག་དེ་ལ་ལོ་ཐང་འབུལ་བ་ཡིན་ནམ། དེ་དག་གིས་སྨྲས་པ། ལྷ་ལོ་ཐང་འབུལ་བ་ལགས་སོ། །དེས་སྨྲས་པ། ཤེས་ལྡན་དག་ཞོ་ཤས་འཚོ་བ་དེ་དག་བོས་ཤིག །དེ་དག་གིས་བོས་པ་དང་། དེས་སྨྲས་
པ། ཤེས་ལྡན་དག་དེ་ཡང་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོར་དབང་བསྐུར་བ་ཡིན་ལ། ངེད་ཀྱང་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོར་དབང་བསྐུར་བ་ཡིན་ན། ཅིའི་ཕྱིར་ཁྱེད་ཅག་ལོ་ཐང་དང་དཔྱ་སྡུད་པར་བྱེད། དེང་ལ་ཕྱིན་ཆད་ལོ་ཐང་དང་དཔྱ་མ་སྡུད་ཅིག །དེ་དག་གིས་བསམས་
པ། གཞོན་ནུ་འདི་ནི་རྒྱུས་མི་ཤེས་པ་ཡིན་པས་བདག་ཅག་རྒྱལ་པོ་པད་མ་ཆེན་པོའི་གན་དུ་འདོང་ཞིང་སོང་ནས་བསྙད་པར་བྱའོ་སྙམ་ནས། དེ་དག་རྒྱལ་པོ་པད་མ་ཆེན་པོའི་གན་དུ་སོང་སྟེ་ཕྱིན་ནས་སྨྲས་པ། ལྷ་བདག་ཅག་ཨང་གའི་རྒྱལ་པོའི་ཞོ་ཤས་འཚོ་བ་ལོ་ཐང་དང་དཔྱ་
སྡུད་པ་ན་གཞོན་ནུ་གཟུགས་ཅན་སྙིང་པོས་བཀག་ན། ཅི་བསྡུ་བར་འཚལ་ལམ། འོན་ཏེ་སླར་མཆི་བར་འཚལ། དེས་སྨྲས་པ། ཤེས་ལྡན་དག་གཞོན་ནུ་དེ་ནི་རྒྱུས་མི་ཤེས་པ་ཡིན་པས་ཁྱེད་ཅག་སྔོན་ཇི་ལྟར་ལོ་ཐང་དང་དཔྱ་སྡུད་པ་དེ་བཞིན་དུ་སྡུས་ཤིག །དེ་དག་གིས་
"""  # noqa
font_sizes = [12, 14]  # Adjust the font size as needed

# Define probabilities for each dimension
dimension_probs = [0.5, 0.5]

# Define probabilities for each font size
font_size_probs = {12: 0, 14: 1}


def test_generate_modern_page_images():
    (
        page_images_with_bbox,
        page_images_without_bbox,
        dimension_count,
        bbox_details,
        polygon_bbox_details,
    ) = mpgobject.generate_modern_page_images(
        text, font_sizes, font_path, dimension_probs, font_size_probs
    )

    # Get the dimension of the first page image
    page_width, page_height = page_images_with_bbox[0][0].size

    # Create the filename with dimension
    dimension_prefix = f"{page_width}x{page_height}"
    page_images_dir = Path("./tests/data/modern_format_page_img")
    page_images_dir.mkdir(parents=True, exist_ok=True)

    # Save the image with bounding boxes
    page_image_path = (
        page_images_dir / f"{dimension_prefix}_modern_format_page_image.png"
    )
    page_images_with_bbox[0][0].save(page_image_path)

    # Save the image without bounding boxes
    page_image_without_bbox_path = (
        page_images_dir
        / f"{dimension_prefix}_modern_format_page_image_without_bbox.png"
    )
    page_images_without_bbox[0][0].save(page_image_without_bbox_path)

    rotation_aug = BackgroundAugmentation(
        page_images_with_bbox[0][0], "./data/backgrounds"
    )  # Use a fixed angle or generate a random angle within a range
    rotated_image = rotation_aug.apply()
    # Save the rotated image with bounding boxes
    rotated_image_path = page_images_dir / f"{dimension_prefix}_aug_withb_box.png"
    cv2.imwrite(
        str(rotated_image_path),
        cv2.cvtColor(np.array(rotated_image), cv2.COLOR_RGB2BGR),
    )
